# من فضلك قم بإدخال الاسم:
# خالد محمد
# من فضلك قم بإدخال السن:
# ٣٥
# الأسم: خالد محمد
#  السن:35 سنة
# إذهب إلى الوحدة الصحية بجوجر لتلقى التطعيم!

def pname_age():
    print("الأسم: " + name + "\n السن:" + str(age) + " سنة")


name = input('من فضلك قم بإدخال الاسم:\n')
age = int(input('من فضلك قم بإدخال السن:\n'))

x = bool # boolean = True=1 | False= 0
if age <= 14:
    pname_age()
    print('لايوجد تطعيم لهذة الفئة')
elif age >14 and age <=25:
    print('فترة الشباب!')
else:
    pname_age()
    print('إذهب إلى الوحدة الصحية بجوجر لتلقى التطعيم!')
